{"turn_id": 1, "speaker": "A", "start": 160, "end": 2080, "text": "To what extent are you open to a Palestinian state?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 2, "speaker": "B", "start": 2240, "end": 4320, "text": "Zero. It has zero right to exist.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 3, "speaker": "A", "start": 4320, "end": 4640, "text": "Zero.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 4, "speaker": "B", "start": 4720, "end": 5840, "text": "Zero right to exist.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 5, "speaker": "A", "start": 5920, "end": 6320, "text": "Right.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 6, "speaker": "B", "start": 6800, "end": 7200, "text": "Zero.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 7, "speaker": "A", "start": 7280, "end": 7840, "text": "Okay.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 8, "speaker": "B", "start": 8240, "end": 9120, "text": "It's unethical.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 9, "speaker": "A", "start": 9120, "end": 16000, "text": "To what extent, to what extent do you think that Israel has a right to or had a right to exist pre existence?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 10, "speaker": "B", "start": 16240, "end": 28400, "text": "I think, I think I like to take the, the new cop out approach that most Arabs do, which is no right, no state has a right to exist. But if you fight for it, you earn it legitimately. And that's what Israel did.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 11, "speaker": "A", "start": 28400, "end": 40630, "text": "And I said cynicism about Israel that I don't fully share, although I reach sometimes similar conclusions, but through a very different way.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 12, "speaker": "B", "start": 40950, "end": 41430, "text": "Okay.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 13, "speaker": "A", "start": 41430, "end": 77960, "text": "I think I. Adar has a very kind of like, energetically. I think he's. He has a superpower of just zooming out and not having to struggle with details and really seeing the big picture. And it's remarkable that he is able to do it to the extent that he does. For me, I'm a little bit more like detail driven and like bottom up. Let's actually build a very specific case. And so he and I often clash on things. Although I think that. I think I watched some of your stuff and I think I would, I would probably be quite far from, from you really, and much closer to him.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 14, "speaker": "B", "start": 78120, "end": 80360, "text": "Do you know, like, do you know what to say in what specifically?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 15, "speaker": "A", "start": 81170, "end": 81730, "text": "Oh, man.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 16, "speaker": "B", "start": 83730, "end": 86610, "text": "It's not like a quiz too. If you don't, if you don't remember, it's fine.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 17, "speaker": "A", "start": 86850, "end": 91730, "text": "No, I listened to something the other day and I thought it was really fun at first. I think you did. Excellent.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 18, "speaker": "B", "start": 91810, "end": 92290, "text": "Thank you.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 19, "speaker": "A", "start": 92290, "end": 102330, "text": "Excellently. It was with a guy who was. Oh, Palestinian. Oh, I think. No, Was it. And you muted him or something like that? I don't know.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 20, "speaker": "B", "start": 102330, "end": 103370, "text": "I do that. I don't know.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 21, "speaker": "A", "start": 103370, "end": 112280, "text": "It was something funny. Something pretty funny. Yeah. I mean, I would have some questions for you. I don't. I'm not that familiar with your work, but I would have some questions for you.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 22, "speaker": "B", "start": 112280, "end": 120480, "text": "Sure, let's do it. Let's go. So I'm recording, by the way, if this is a good conversation, I'll probably upload it. Is that okay?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 23, "speaker": "A", "start": 122000, "end": 122680, "text": "Sure. Yeah.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 24, "speaker": "B", "start": 122680, "end": 123120, "text": "Okay.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 25, "speaker": "A", "start": 123760, "end": 131840, "text": "Yeah. So by your lights, do you. First, are you. To what extent are you open to a Palestinian state?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 26, "speaker": "B", "start": 132260, "end": 134140, "text": "Zero. It has zero right to exist.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 27, "speaker": "A", "start": 134140, "end": 134500, "text": "Zero.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 28, "speaker": "B", "start": 134580, "end": 135620, "text": "Zero right to exist.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 29, "speaker": "A", "start": 135700, "end": 136100, "text": "Right.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 30, "speaker": "B", "start": 136580, "end": 136980, "text": "Zero.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 31, "speaker": "A", "start": 137060, "end": 137620, "text": "Okay.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 32, "speaker": "B", "start": 138020, "end": 138900, "text": "It's unethical.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 33, "speaker": "A", "start": 138900, "end": 146980, "text": "To what extent. Unethical. To what extent do you think that Israel has a right to or had a right to exist pre existence?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 34, "speaker": "B", "start": 147140, "end": 217120, "text": "I think, I think I like to. I like to take the, the new cop out approach that most Arabs do, which is no right. No state has a right to exist. But if you fight for it, you earn it legitimately. And that's what Israel did. And I think that Palestine, if you were to look at it today, and the moral equivalency is that you would be creating a 53rd Arab ethno state or, or sorry, a 53rd Muslim supremacist state or a 23rd Arab ethno state in the Middle East. It would be a big you to the Kurds, to the Assyrians, to the Mandeans, to the cops, to every single ethnic minority, the Amazigh people, every single ethnic minority in the Middle east that is crying and begging for independence from Arab supremacy and Islamic supremacy. It's just, it's unethical. It has zero right to exist. But I also believe that, by the way, like Jordan, I don't think Jordan has a right to exist. I think it was a mistake that Jordan exists. It's an apart. It's an actual apartheid state that has Arabs from Mecca and Medina sitting on ancestral Levantine land, something that could have potentially been a Palestinian state. And they're just sitting there occupying it violently.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 35, "speaker": "A", "start": 217680, "end": 252170, "text": "So I'm, I'm picking up some. So correct. This tension then that I'm, that I'm hearing. Are you saying that they don't have. Because on one hand it sounds like you're saying you don't believe that states have rights to exist. If you fight for it, it exists. On the other hand, you evaluate the ethical balance of giving them that right. And so how do I. Is rights. Either we speak, we don't speak about rights, or we do speak about rights. You seem to be speaking both languages.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 36, "speaker": "B", "start": 252490, "end": 254170, "text": "I am speaking both languages.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 37, "speaker": "A", "start": 256010, "end": 265570, "text": "So, so let's be. So which one should we. So like when you first said states don't have rights, I can use that frame and I can evaluate.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 38, "speaker": "B", "start": 265570, "end": 326880, "text": "I think, I think in a world, I think in a world of supremacy and colonization, it's hard to like which, which is Arabism is. And the, you know, the Islamic Ummah or the, you know, the whatever, whatever dreams of a caliphate still exist in the Middle East. We have to sort of tackle that with one set of logic. And you don't apply the logic equally across the board in the Middle east because if you were to do that, then every ethnic minority in the Middle east would technically be a, the same way that we do it with Israel, by the way, or with settlers in the West Bank. Every single ethnic minority in the Middle east would be A settler or a colonizer, because you're technically colonizing and settling out of blend, which is the way that the Arabs and the Muslims see it. So when you have a world of, I'm sure you've heard of this, of dar al Islam and dar al harb, if you're familiar with this concept, you cannot, you cannot apply logic equally towards Israel and towards the Palestinians. It doesn't, that doesn't work. And I'm not looking to, by the way.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 39, "speaker": "A", "start": 328000, "end": 344440, "text": "Yeah, yeah, it's, I'm just trying to evaluate how you see the world. Right. Not necessarily how they see the world. Right. Like they might want it for Islamic supremacist reasons, but I'm trying to evaluate on the basis of what you think getting a state is considered.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 40, "speaker": "B", "start": 344440, "end": 358880, "text": "I see the world the way that they see the world. Actually. I tend to even agree with their way of life, but I want to fight them. Like I, I agree with their mindset, but they need to be proven that their path is wrong. I think so, yeah.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 41, "speaker": "A", "start": 359120, "end": 361760, "text": "So let me, let me, let me maybe like unpack it a little more then.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 42, "speaker": "B", "start": 361760, "end": 362080, "text": "Sure.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 43, "speaker": "A", "start": 362160, "end": 370560, "text": "So what do you mean by state? And do you mean, do you think that Palestinians should self determine?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 44, "speaker": "B", "start": 370640, "end": 388010, "text": "No, absolutely not. They should live with us. Those of who wants to live with us. No, not ruled over. They should live with us. They should live with us. I mean, ruled over, I guess. This is the Middle east. Everyone's being ruled over by somebody. So I mean, technically, I don't really like the terminology, but yes, I guess so.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 45, "speaker": "A", "start": 388570, "end": 400490, "text": "Okay, so let me, let me make it more precise. Do you think that Palestinians in the west bank should have equal vote, equal say in how to determine their own affairs?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 46, "speaker": "B", "start": 400490, "end": 426290, "text": "It's not going to work. It won't work. But I also don't believe that Israel can survive as a democracy in this region. In the current framework, I don't think it can. I'll put it to you this way. Let me break it down for you in the most easiest way. Like I sort of hone this down into a very good talking point. Right now you have three options in front of you as an Israeli. And we, and we both establish here, the two of us want peace, right? We both, I would assume you love Palestinians.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 47, "speaker": "A", "start": 426610, "end": 427570, "text": "You and them are.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 48, "speaker": "B", "start": 427980, "end": 569540, "text": "No, like you, you and I, we both want peace, right? We both, we both love Palestinians. I'm assuming you do as well if you're friends with Adar. I'm assuming so because I know he does. I def, I definitely do. And I love Arabs, I love Islam. I have a rudimentary level of respect for it as well. But I also am not like, I'm not living in a fantasy. So I, I see the world right now where Israel solutions in three manners, all three. In the current framework, democracy can't survive. All three are heading towards a war, an existential war too. So in option number one, we stay the status quo right now. Settlers in the west bank keep expanding settlements, tensions keep rising in the west bank between Palestinians and Israelis, and eventually they end up going to a full war. Right? That's option number one. Option number two is that we give them a Palestinian state and ask any Palestinian about this question. But not, I'm not talking about some peace. Like what, I'm not, I'm not talking about the work that they used to do at habit, if you know what habit is. But I'm not talking about that kind of context. I'm talking go to a Palestinian's home and ask them the legitimate question. And if they get a state and they have an army, an unfettered access with a highway from Palestine, from Ramallah to Jordan, from Jordan to Iraq and Iraq to Tehran, a direct access from Tehran to Palestine. With zero borders. Yeah, zero. Checking. It's a fluid border. If they have an army well equipped, they can get all that funding from Iran. What is the first thing that they do? All of them will tell you wholeheartedly. Within a year, you're attacking Israel. So there's your second option. You have a war, you have to fight Palestine, probably conquer it again. So you've just started a war with the newly founded state of Palestine. Option number three is you declare sovereignty over the West Bank. You take it under the rule of Israel, create one state of solution. You're going to still have to fight a war. Yeah, the Palestinians are still going to fight you. But you fight it on your turf, on your rules, you start the war, you don't get surprised by it. Like in option one and two, you can actually defend those borders. And you can say similar to what happened in 1948, like what happened with the mayor of Nazareth. You say, if you want to live with us in peace, we're taking this land. It's ours now. There's no more Palestine. We got to kill that idea.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 49, "speaker": "A", "start": 570180, "end": 574300, "text": "So, okay, so walk me through. So option one again is settlement expansion.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 50, "speaker": "B", "start": 574300, "end": 577780, "text": "It's a status quo. Stays the way it is right now. It's heading towards a war.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 51, "speaker": "A", "start": 577780, "end": 578700, "text": "Managing the conflict.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 52, "speaker": "B", "start": 578700, "end": 584500, "text": "Yeah, like it's, it's heading towards a war. As we see it today, every settler in the west bank knows it. Every Palestinian in the west bank knows it.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 53, "speaker": "A", "start": 584820, "end": 589890, "text": "But what kind, what kind of war are you picturing in case one that is different from in case three?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 54, "speaker": "B", "start": 590530, "end": 602010, "text": "Case one is actually pretty brutal because there's a lot of like black arms, how can I say, like illegal gun smuggling in the west bank right now. And we know, like, we, we know Nabilus is armed to the teeth.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 55, "speaker": "A", "start": 602010, "end": 608450, "text": "We know case one is not state sponsored by your lights. And case three is, that's the difference.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 56, "speaker": "B", "start": 608690, "end": 609970, "text": "State sponsored on what side?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 57, "speaker": "A", "start": 609970, "end": 616350, "text": "You mean like, that's like Israeli state. It's not like the IDF is marching in and.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 58, "speaker": "B", "start": 616430, "end": 621070, "text": "Well, eventually they will, right? Like if you, if they declare war the way the October 7th did in.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 59, "speaker": "A", "start": 621150, "end": 624990, "text": "Every scenario state sponsored between scenario one and scenario three.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 60, "speaker": "B", "start": 625550, "end": 639550, "text": "Scenario one, is this disadvantageous to you because it starts ambiguously. Option number three, you start the war on your terms. You decide when it starts. You declare, I'm taking this land and I'm starting a war with you. Whoever's in is in, whoever's out is out.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 61, "speaker": "A", "start": 640750, "end": 662290, "text": "Got it? Okay, so you see? Okay, so case three, Israel says, this is all mine. You figure out how to live with it. Case two is Palestinians have a state and immediately they're on an express lane to arming themselves and waging war against you.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 62, "speaker": "B", "start": 662290, "end": 663650, "text": "Yeah, it's a case one.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 63, "speaker": "A", "start": 664450, "end": 669290, "text": "In case one is the status quo. That is just a slow boiling.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 64, "speaker": "B", "start": 669450, "end": 670090, "text": "Exactly.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 65, "speaker": "A", "start": 670970, "end": 676730, "text": "Got it. Okay, so that's how you see the world. And based on this, you say you want.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 66, "speaker": "B", "start": 676810, "end": 679130, "text": "Which Option three, of course.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 67, "speaker": "A", "start": 679930, "end": 682730, "text": "Okay, and so what does that look like in practice?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 68, "speaker": "B", "start": 683690, "end": 697460, "text": "Declaring sovereignty over the west bank in an immediate. Whatever militant militias are, you know, that exist through Nablus, they immediately attack and you have a full blown war. Like you have a pretty much like an armed citizen struggle.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 69, "speaker": "A", "start": 697540, "end": 711340, "text": "No, but what does that, what does that mean? Okay, so it means, is it okay if. I'm sure that if you're gonna upload this, you probably have audience that's familiar with what's happening in Gaza. Now to what extent is it similar to what happens in Gaza?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 70, "speaker": "B", "start": 711340, "end": 729590, "text": "I don't, I don't think it's as similar because I'm not sure that bombing campaign, the way that it was done in Gaza will be possible considering the proximity that people live to each other. But most settlements are armed to the teeth, right? Most have. I don't know how to say it in English. Whatever.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 71, "speaker": "A", "start": 729590, "end": 734670, "text": "It's like readiness, readiness groups or readiness, something.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 72, "speaker": "B", "start": 735150, "end": 740430, "text": "They're like, they're like well trained. Not militias, but like, like it's like.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 73, "speaker": "A", "start": 740430, "end": 741830, "text": "Patrol for Each one?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 74, "speaker": "B", "start": 741830, "end": 761650, "text": "Yeah, like community patrol. So I think you'll have more control in general over what you'll be able to accomplish with those groups. And I also think, by the way, that there's a fairly sizable population in the west bank that's willing to just live under Israel. Like, many of them want it, I'm sure you know as well. But, yeah, it's like, basically, it's all.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 75, "speaker": "A", "start": 761650, "end": 764010, "text": "I don't know. How would you. How do you know? Sizable.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 76, "speaker": "B", "start": 765370, "end": 781240, "text": "I mean, I have plenty of conversations with them. Again, I can't. This is more of a feeling than it is a statistic. I mean, look, every statistic coming out of whatever Palestine is any Palestin. Like, can you trust any of it? They're not really allowed to say they're.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 77, "speaker": "A", "start": 781240, "end": 786200, "text": "No. I'm just trying to figure out, like, based on what? Based on what? Like you're just getting some intuition.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 78, "speaker": "B", "start": 786200, "end": 800720, "text": "Based on conversations that I have with them on a regular basis. I talked. I talked to, on average, three to five Palestinians a day, some in dm, some in conversations here from wildly different backgrounds, some deeper conversations, some shorter conversations.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 79, "speaker": "A", "start": 800720, "end": 807790, "text": "Get the impression that is it. Would you say that it's more than half of the people that you speak to, I don't know, think that they want to live?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 80, "speaker": "B", "start": 807870, "end": 808590, "text": "No, I don't.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 81, "speaker": "A", "start": 808590, "end": 814750, "text": "Would you say it's like, even less, more than 20 of the people you speak to? I would say more than 20 live under Israeli sovereignty.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 82, "speaker": "B", "start": 814750, "end": 815950, "text": "I would say more than 20%.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 83, "speaker": "A", "start": 816990, "end": 825190, "text": "More than 20. And does that sovereignty mean to them Jewish supremacy? What does that mean?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 84, "speaker": "B", "start": 825190, "end": 841560, "text": "No, I don't think they process it as Jewish supremacy, but. But the thing is, I think they do. I think that the Arab world sees the world a little bit binary, like it's rule or be ruled. So I'm not sure that it's supremacy in the way that we. I perceive their rule as supremacy.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 85, "speaker": "A", "start": 841800, "end": 843720, "text": "I'm just wondering what they mean by that.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 86, "speaker": "B", "start": 845000, "end": 845560, "text": "By what?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 87, "speaker": "A", "start": 845640, "end": 849440, "text": "I'm just curious. I'm just. I'm just curious if they don't see it as supremacy.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 88, "speaker": "B", "start": 849440, "end": 850880, "text": "I don't. I don't. I don't think that.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 89, "speaker": "A", "start": 850880, "end": 858840, "text": "That even if they see it as rule or be ruled, they say, yes, it's okay, I want to be ruled by Jewish Israelis. Is that. That's the impression.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 90, "speaker": "B", "start": 858920, "end": 869160, "text": "I don't know that the 20. I don't know what to say, honestly, that above 20 will see it as supremacy. I. I really don't know to gauge that either way. I think it's irrelevant. I don't think it's.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 91, "speaker": "A", "start": 869160, "end": 883560, "text": "Well, No, I think it's crucial. I think it's crucial if they say, well, yeah, we just want to. Because it's, it's different. If they say, yeah, what Israel has figured out is something we would like to take part in, that is governance, democratic institutions.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 92, "speaker": "B", "start": 883800, "end": 885880, "text": "You think that, you think that they care about democracy?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 93, "speaker": "A", "start": 888090, "end": 889130, "text": "I think some of them do, yeah.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 94, "speaker": "B", "start": 889130, "end": 891130, "text": "Some of them. Do you think it's more than 20%?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 95, "speaker": "A", "start": 894010, "end": 907570, "text": "I think it's more than 20% that would not want to live under Jewish control. Yeah. And would like to have equal. So, yeah, I think, I think the dignity and equality matters to a lot of people.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 96, "speaker": "B", "start": 907570, "end": 921390, "text": "Yeah, I would tend to disagree with that. I don't think that Palestinians. I don't think that one. Equality is important to Palestinians at all because they're not equal in their own society. I mean, they oppress each other. Like. Let's talk for a second, just for one moment. I mean, are you.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 97, "speaker": "A", "start": 921470, "end": 927150, "text": "But that, but, but that is a challenge for them. Right? So like, I asked them to. I speak to just as many Palestinians.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 98, "speaker": "B", "start": 927310, "end": 929630, "text": "I'm sure, I'm sure, I'm sure, yeah.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 99, "speaker": "A", "start": 929710, "end": 940670, "text": "The fact that their societies are unequal doesn't mean they're happy about it, you know, doesn't mean that aspirationally that's what they desire. It means that that's the situation.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 100, "speaker": "B", "start": 941300, "end": 943300, "text": "Habibi, that is a false statement.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 101, "speaker": "A", "start": 943940, "end": 953940, "text": "Really. You, you, you think, you seem to think that most Palestinians you speak to love being controlled by the PA or by Gaza. Like that is.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 102, "speaker": "B", "start": 953940, "end": 1010189, "text": "Oh, I'm not talking about that. I'm not. I'm talking about something way deeper than the factions that are controlling them. I'm talking about internal Palestinian society. This is what I wanted to break down with you for a moment. The, the internal, even the, the ethnicities that make up what a Palestinian is and how they internally oppress each other and hate each other like it is. It's absolutely disgusting. It's horrible. And that's why, by the way, it has no feet to stand on as a state because there's a certain sect of Palestinian society which is the ethnic. But let's just say the. Even though it doesn't really make a lot of sense, whatever they perceive to be the ethnically Arab Palestinians, usually, not always, but usually the more lighter skinned passing ones. Yeah. Are going to be the ruling class of this foreseeable Palestinian state. But anybody Eastern Bedouin. Yeah, but just Bedouin's in the West Bank, Bedouins in the south, Bedouins in the north, all hate each other and fight each other. And would violently kill each other.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 103, "speaker": "A", "start": 1011310, "end": 1032130, "text": "You see, like, it's funny because when you speak like that to people from the outside, all they hear is colonialism. Like, do you hear that? Do you hear how. How everything you've just said is the. That's the typical tools that colonialists use to describe why. To dispossess local inhabitants of their rights.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 104, "speaker": "B", "start": 1032290, "end": 1032650, "text": "No.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 105, "speaker": "A", "start": 1032650, "end": 1037570, "text": "At least I just. I just. No, you might not see it this way, but that is what they hear.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 106, "speaker": "B", "start": 1037650, "end": 1049080, "text": "No, absolutely not. This is a product of their own colonialism. This isn't. This isn't something that a colonialist is saying to justify. It's something to address their own colonialism. I mean, explain to me real quick what.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 107, "speaker": "A", "start": 1049960, "end": 1051400, "text": "Sorry. Both of those could be true.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 108, "speaker": "B", "start": 1052360, "end": 1058600, "text": "Okay. I guess we could say both of those would be true. I'm not gonna say. No, let's say both of those could be true. Can you explain to me what a Palestinian is?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 109, "speaker": "A", "start": 1061640, "end": 1064280, "text": "Yeah, but I don't think that's a necessarily.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 110, "speaker": "B", "start": 1064280, "end": 1068280, "text": "It's an important brain experiment, if you don't mind flowing with me on it for a moment.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 111, "speaker": "A", "start": 1068600, "end": 1095090, "text": "Yeah, for sure. I think Palestinians are people that have lived in the region that was traditionally called Palestine. It doesn't matter why it's called Palestine. They've lived there. They've lived there for generations. They have a unique dialect and cuisine and, And. And rituals and literature and an increasingly shared collective memory and shared collective aspirations. They see each other.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 112, "speaker": "B", "start": 1095090, "end": 1096170, "text": "Are they an ethnicity?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 113, "speaker": "A", "start": 1097850, "end": 1099290, "text": "I don't know. Doesn't matter.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 114, "speaker": "B", "start": 1099530, "end": 1123430, "text": "It is actually important because when I have to ask the question, what is a Palestinian? I have to always. I always point out to the fringes of their right, the Afro Bedouins of Jericho, the Afro Bedouins of Rahat and of Gaza that are referred to as Alabid. I mean, this is something that happens today till 2025, still going on the Domari Palestinians of the. Of the west bank in East Jerusalem.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 115, "speaker": "A", "start": 1124150, "end": 1125510, "text": "I don't see the relevance of that.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 116, "speaker": "B", "start": 1125510, "end": 1128470, "text": "Of course there's relevance. Like, are they Palestinian as well?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 117, "speaker": "A", "start": 1129750, "end": 1146450, "text": "I could say the exact same thing about, let's say, like the Indians from the Indian subcontinent. Right. Like, you know that you, you could go and parse lots of different ethnicities. Nevertheless, they all identify as Indian because of very specific things that are unique to.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 118, "speaker": "B", "start": 1146450, "end": 1147210, "text": "What if they don't?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 119, "speaker": "A", "start": 1147210, "end": 1159090, "text": "The same way that if they don't, they don't. That's fine. They may not have to. But if people do that, the question is, do I consider them Palestinian or do they consider themselves Palestinian? Which. What exactly is your question?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 120, "speaker": "B", "start": 1159530, "end": 1165690, "text": "Well, I Was asking you more. So just about, are they Palestinian? Like, do they.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 121, "speaker": "A", "start": 1165850, "end": 1194190, "text": "Like, that is. It's not as. It's not a concept that in my mind holds a lot of water. Like, it doesn't matter to me if you, this, if, if you label yourself Palestinian, if you partake in that type of culture from that part of the world, then you're Palestinian. Who cares? Like it's invented or what? Doesn't matter. Let's say it's invented. So what? It's now it's invented. Now it's with us. Let's say it emerged in reaction to Jewish colonialism.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 122, "speaker": "B", "start": 1194190, "end": 1196350, "text": "So if I decided I was a turtle, is that okay?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 123, "speaker": "A", "start": 1197390, "end": 1205390, "text": "Well, no, because a turtle is a very specific turtle is a zoological.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 124, "speaker": "B", "start": 1205870, "end": 1211550, "text": "Like, okay, if I decided, if I was. I decide from now on, I identify as a Native American. Is that okay?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 125, "speaker": "A", "start": 1211900, "end": 1220700, "text": "No, but that's not how human groups work. Right. It's. All I'm saying is that that group defines themselves. They use that label to describe their experience.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 126, "speaker": "B", "start": 1220860, "end": 1226780, "text": "Okay. I just. I decide from now on, I'm Syrian again, you're.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 127, "speaker": "A", "start": 1226940, "end": 1232180, "text": "You're mocking it. And I don't think you're introducing clarity by doing it. I think you're making it more difficult for you to understand.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 128, "speaker": "B", "start": 1232180, "end": 1236780, "text": "I'm not mocking it at all. I'm talking the same way that I speak to Palestinians. And they actually wake up from this point often.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 129, "speaker": "A", "start": 1237750, "end": 1265470, "text": "No, but listen. So the idea is not whether I consider certain people to be Palestinian, it's that I understand that there is a group that shares certain things in common and considered themselves to be Palestinian. That's the label they use to describe the similarity of their experience. That's it. I don't have to go beyond that. Below that, underneath it. What does it really mean? And where did the name come from? And what's the genes and what's the DNA like? That's all it means.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 130, "speaker": "B", "start": 1265470, "end": 1268310, "text": "Of course you do. And by the way, you have to. You have to.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 131, "speaker": "A", "start": 1268470, "end": 1269100, "text": "None of that matters.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 132, "speaker": "B", "start": 1269810, "end": 1314240, "text": "Maybe it doesn't matter to you, but you have to look into it because one, there's two. There's two sides to that, by the way. One, they're doing that to us, to the Jews, to the. Is, to Israel. That's one. And it's very important. I don't think it's silly. I don't think it's silly at all. This is the Middle East. This is how the Middle east works. This is. Thus is the Middle East. Of course it does. The entire region. The entire region is based on ethnic supremacy and genetic Inbreeding, that's the whole region. Everybody. It's all clans and tribes looking at each other and saying, I won't breed with you. I won't make children with you. I won't make a pact with you. I'll make a country with you because you're of xxx. And by the way, the reason why I bring up the Palestinian ethnicities is because they won't have sex with Afro Bedouins and mix with them. They won't have sex with Damaris and mix with them.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 133, "speaker": "A", "start": 1314240, "end": 1319800, "text": "That's on them, bro. Like, we have Russians that don't have sex with Ethiopians. I don't care. That doesn't mean they're not Israeli. That doesn't mean they're not Jews.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 134, "speaker": "B", "start": 1319800, "end": 1322400, "text": "Do they kill each other? Do Ethiopians and Russians kill each other?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 135, "speaker": "A", "start": 1323640, "end": 1325680, "text": "It doesn't matter. Like, that doesn't go into the difference.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 136, "speaker": "B", "start": 1325680, "end": 1327560, "text": "Of course it does. Of course it does.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 137, "speaker": "A", "start": 1328440, "end": 1331160, "text": "And, and not all of those groups kill each other either.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 138, "speaker": "B", "start": 1331480, "end": 1332760, "text": "They do pretty frequently.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 139, "speaker": "A", "start": 1333640, "end": 1345640, "text": "I'll tell you why. But it's all a distraction. Okay, the core here is I don't believe in nation states in the first place. Right. I think that that is a foreign concept. I think that the concept.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 140, "speaker": "B", "start": 1346280, "end": 1347000, "text": "Thumbs up.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 141, "speaker": "A", "start": 1348440, "end": 1349720, "text": "Was that an apple thing?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 142, "speaker": "B", "start": 1349720, "end": 1353240, "text": "Yeah, it always breaks the I'm listening and like, bubble.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 143, "speaker": "A", "start": 1353240, "end": 1355080, "text": "It has other things too that you could do.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 144, "speaker": "B", "start": 1355080, "end": 1359960, "text": "Yeah. The. You don't believe in. What do you mean by you don't believe in nation states?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 145, "speaker": "A", "start": 1360360, "end": 1436310, "text": "I'll tell you in a second. But like, the reason that I think it's a distraction is because. And again, this is my. You might have a different reading of the history here. Okay, I see, like when Woodrow Wilson comes in and says every people need to have their own state that essentially like builds. That links political power to your concept of peoplehood. And now we have to play this game for 100 years. Are they really a people? Are they an ethnicity? Are they this? Who cares? I don't care about any of that. That doesn't matter to me. Right. I think that that is a foreign game because he. Even at the, the Treaty of Versailles, he came, he. He said, I didn't realize there were that many people. I didn't realize there were that many nations. That's not what I had in mind. I thought there was just a handful more and that's it. And so I said to every people deserves that. I don't want to fall into that trap because it doesn't matter to me. I look at people as individuals. I see Palestinians and I see that they are being ruled over by somebody else. And the question is, should they. Should that be the status quo? Should they live like other people that have a say in their own affairs or not? You can call them whatever you want. You could say that another tribe is killing another tribe. None of that makes, in my mind, a moral difference to the question of who should be in control of their own lives. That's really it. Everything else, that's a.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 146, "speaker": "B", "start": 1436310, "end": 1443790, "text": "That's a beautiful explanation, but you're also kind of contradicting yourself because you said you don't believe in nation states, so they. They. You do believe in nations.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 147, "speaker": "A", "start": 1444990, "end": 1460510, "text": "No, I don't believe that a state should be. I don't believe there's a right for every nation to have a state. Because now we're playing the language game of what is a nation? Does it mean a language? Doesn't mean a dialect. Dismantle. I don't want to. Who the hell has time for this? No, no one has time for this.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 148, "speaker": "B", "start": 1460510, "end": 1461150, "text": "People who care.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 149, "speaker": "A", "start": 1461150, "end": 1462790, "text": "That's not the way to build things, huh?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 150, "speaker": "B", "start": 1462790, "end": 1472790, "text": "People who care. I mean, I think it ends up coming down to what's your. Like, what's your humanity goal? I'm assuming it's a little bit more Kumbaya on your end, right? Like, more like we're all one and we all come together and we all.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 151, "speaker": "A", "start": 1474150, "end": 1486150, "text": "No, I just don't see the need to delineate. Like, look, I. I get that we have to do this game now because we're all so tribal and so right now. Yes, I understand pragmatically, that's how the world is split.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 152, "speaker": "B", "start": 1486150, "end": 1486550, "text": "Correct?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 153, "speaker": "A", "start": 1486550, "end": 1493830, "text": "Aspirationally, I wish it doesn't. Right. I hope that we manage to outgrow these bugs. These are bugs in the system.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 154, "speaker": "B", "start": 1493830, "end": 1502670, "text": "I don't agree, man. I don't agree at all. We're in the Middle east, baby. This is us. This is it. This is where we are. This is what we've always been. We've always been. This.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 155, "speaker": "A", "start": 1502670, "end": 1504430, "text": "It makes us all dumber, I think.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 156, "speaker": "B", "start": 1504430, "end": 1507070, "text": "It doesn't, actually. It doesn't at all, actually.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 157, "speaker": "A", "start": 1507070, "end": 1508990, "text": "Don't think. I don't think that's how it always was.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 158, "speaker": "B", "start": 1509150, "end": 1517120, "text": "Imagine what we could accomplish if we all took care of our own little groups and work together. Some groups will not work together as fluidly. That's obvious.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 159, "speaker": "A", "start": 1517920, "end": 1554390, "text": "But you can't, because these groups are just. It's almost like. Like, just, I don't know, like, I'm picturing, I don't know, like, grass or trees, right? Or some other kind of, like, plant life. Like they're not just bounded up so cleanly. Everything is merging into everything else. Everything is so much more vibrant and fused. And what you're trying to do is say, okay, but if only in this plot of land we had this, and in that plot of land we had that. That rarely works. That's not how it works. If that was the situation, fine, maybe then nation states could make sense. But geography gets in your way of nation states.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 160, "speaker": "B", "start": 1554470, "end": 1572000, "text": "First of all, I think that was a gross oversimplification of how the way that nature works. Actually, nature works way more closely than what I'm talking about. Certain species of plants and animal, down to the hyper tribe, will stay fixated in one specific area and not intermix even with a similar plant. It's not all.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 161, "speaker": "A", "start": 1572080, "end": 1575520, "text": "I'm not talking about intermixing. I'm talking about the geographical distribution.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 162, "speaker": "B", "start": 1575760, "end": 1582640, "text": "Same, by the way, like, one species of grass in Wisconsin is gonna be completely different from the grass in Kazakhstan, and they'll stay to that region.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 163, "speaker": "A", "start": 1582720, "end": 1584680, "text": "Gradient. No, but there's gradient.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 164, "speaker": "B", "start": 1584680, "end": 1658810, "text": "But it's more of looking at the world, and I feel like I can see where this conversation is going. And I think it's gonna be very interesting for my audience, too, because I'm curious, but, like, it's more of. In the way that I see it is a beautiful tapestry of different cultures, languages, music, but each in their own determined place, knowing who they are and living authentically as themselves. Not pretending to be something that they are, but living like, the same way that I think. I don't know if you've seen how much of my content I talk about the fakeness that is the Arab world and how the Arab world is one giant facade. It's basically a giant colonialist movement that has raped and destroyed the Middle east for what it used to be, which was this beautiful mosaic of cultures and religions and languages. It's all been taken away from all of us. And I'm actively trying to do my part to help people understand who they actually are. Palestinians involved in that as well. And I know, I know, I know from your end, it may seem. But I'm curious. I just wanted to dip into this real quick because I kind of felt. And I'm not judging you, by the way. Happy to have a conversation about this. Do you see yourself more aligned with, like, a communist or socialist perspective of you'd like for the world to be, like, one cohesive group all sort of working together? Is that kind of what it was? I catching this the correct vibe there?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 165, "speaker": "A", "start": 1659530, "end": 1665450, "text": "No. So I, of course I would like for the world to work together. I think the best way to do that is under capitalism.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 166, "speaker": "B", "start": 1665690, "end": 1670410, "text": "Okay, interesting. Okay. I thought, I thought it was getting a vibe of like communism or socialism.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 167, "speaker": "A", "start": 1671210, "end": 1685780, "text": "Okay. Big free market fan. Okay, cool. Yeah, no, it's. Yeah. I'm just, I'm not sure whether. I don't believe that you're gonna talk people out of their identities.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 168, "speaker": "B", "start": 1686100, "end": 1687820, "text": "You're not gonna watch my channel.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 169, "speaker": "A", "start": 1687820, "end": 1689260, "text": "Arabs are now going to watch my.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 170, "speaker": "B", "start": 1689260, "end": 1691540, "text": "Channel, should watch my videos.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 171, "speaker": "A", "start": 1693140, "end": 1747920, "text": "I think the key point for me here is that I'm not saying that people shouldn't exist in their identities. I just think that you have constraints on your ability to protect your own people and you have competing values here. So, for example, like if the Jews wanted to self determine in Israel and there's nobody else there, and they wanted to just realize some like Judaic picture and have some like fantasy like that's on them, I don't care. They could do whatever they want to do. No one cares. But the problem is that you're not living in a vacuum now. You're living with other people. You also want to be a democracy. Okay, yeah, we want to be a democracy, but we don't want to be a democracy where we are the minority. Okay. So you're just constantly. And the other people that are there are not going to give you that peace of mind. And they're not going to do it even if you take over them. Even scenario one, they're not going to.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 172, "speaker": "B", "start": 1747920, "end": 1748320, "text": "Give it to you.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 173, "speaker": "A", "start": 1748320, "end": 1751120, "text": "In scenario three, they're not going to give it to you. They're simply not going away.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 174, "speaker": "B", "start": 1751200, "end": 1752480, "text": "In scenario two, they will.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 175, "speaker": "A", "start": 1754490, "end": 1756490, "text": "In scenario two, there's a chance.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 176, "speaker": "B", "start": 1756490, "end": 1758490, "text": "But what chance? What chance?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 177, "speaker": "A", "start": 1758730, "end": 1765450, "text": "What chance? Sorry, not. It depends. Not the scenario two that you've painted. Right. But just the premise for scenario two. Right.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 178, "speaker": "B", "start": 1765450, "end": 1771450, "text": "The scenario, Scenario two is you give them a Palestinian state. What happens? They've got a new Palestinian state.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 179, "speaker": "A", "start": 1772170, "end": 1772970, "text": "It depends.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 180, "speaker": "B", "start": 1773050, "end": 1777490, "text": "Let's. Let's say let's pretend right now they've got a Palestinian state. What happens now?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 181, "speaker": "A", "start": 1777490, "end": 1784840, "text": "Okay, I think it's a little caricature, ish, though to go about it this way because I think it needs to be a very long process.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 182, "speaker": "B", "start": 1785320, "end": 1834290, "text": "Do it, do it. Let's do it. Do with your whole. Let's go the whole long process. Let's imagine even. It's like a slow rollout of 20 years into the future. Yeah, it's, it's all done. Okay. Let's say 100 years even. And let's say the UN's on top of it. And. And let's say everything goes fluidly. Yeah. Based on what you were describing as their culture and their shared history and their shared stories and literature and food and all that stuff. Everything. The whole nine yards. You're 100 years down the road. Now, a Palestinian state exists. It has an army. And remember, this is the key. The key important goal is that Iran is still the Iran that we have today. And you have a direct line on a highway. It's one highway, too. It's one road from Tehran all the way to Ramallah. In your worldview, they don't attack Israel.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 183, "speaker": "A", "start": 1837440, "end": 1845880, "text": "Yeah. I think that we'll just have to, like, parse the. The actual risk factors here. Right. So, like, is there a chance they would. They would attack as well?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 184, "speaker": "B", "start": 1845880, "end": 1847200, "text": "100 chance.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 185, "speaker": "A", "start": 1848880, "end": 1850568, "text": "Okay. Nothing is 100.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 186, "speaker": "B", "start": 1850712, "end": 1851360, "text": "100.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 187, "speaker": "A", "start": 1853280, "end": 1854000, "text": "Even. Just.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 188, "speaker": "B", "start": 1854640, "end": 1858400, "text": "It's just based on the track record. Just based on the track record.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 189, "speaker": "A", "start": 1859200, "end": 1875150, "text": "No, no, but. No, but that's not fair because based on the track record, the other person could say, will Israel try to invade and settle our land? 100%. Okay. But we're designing a different scenario, so we have to apply slightly different concepts to that scenario. You have to extend the analogy. Right.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 190, "speaker": "B", "start": 1875150, "end": 1877790, "text": "Okay, so there's a 90% chance they're going to attack Israel.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 191, "speaker": "A", "start": 1877870, "end": 1882110, "text": "Okay, so. Okay, so there's a 10% chance that they won't. Right.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 192, "speaker": "B", "start": 1882110, "end": 1882590, "text": "Okay.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 193, "speaker": "A", "start": 1882590, "end": 1885310, "text": "What do you do to increase that 10% to 90%?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 194, "speaker": "B", "start": 1886670, "end": 1887870, "text": "What do you do to increase.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 195, "speaker": "A", "start": 1889560, "end": 1899240, "text": "Exactly. And I think that's the situation that we're in. So I'm not. I'm looking at Palestinian society. I'm not seeing a society that is necessarily hungry for peace and coexist.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 196, "speaker": "B", "start": 1899240, "end": 1899560, "text": "Correct.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 197, "speaker": "A", "start": 1899560, "end": 1901120, "text": "I'm not delusional in that sense.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 198, "speaker": "B", "start": 1901120, "end": 1901360, "text": "Yeah.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 199, "speaker": "A", "start": 1901360, "end": 1910280, "text": "That's. Don't get me wrong, Israeli society isn't one either at this point, and which also makes a lot of sense to me, bro. They're not looking for peace in the. They're not. They're not looking.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 200, "speaker": "B", "start": 1910280, "end": 1933480, "text": "Bro. Israelis. Israelis are the softest people on planet Earth. They are willing to go to. They are willing to go to war for a whole of 2.5 seconds. And the second they have an opportunity to choose peace over the war, they take it every single time. Our people much rather vacation in Thailand than be doing Shmira in the West Bank. You're.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 201, "speaker": "A", "start": 1934280, "end": 1953630, "text": "But for the audience that is not Israeli, we have to. We have to go a little bit deeper there because the question isn't whether they want peace. Of course they want peace. Right. But that's. Because now they're the strong ones and the relatively safe ones. The question is, and for the Palestinians, you're right. If you talk to them, peace is not the first thing on their mind. No, they want justice.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 202, "speaker": "B", "start": 1953710, "end": 1957590, "text": "In what world are the Israelis the strong ones? This is the thing. I don't.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 203, "speaker": "A", "start": 1957590, "end": 1957830, "text": "You're.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 204, "speaker": "B", "start": 1957830, "end": 1964510, "text": "You're playing into the same card that the Palestinians do, by the way, which is you're. You're breaking this down into the micro rather than the macro.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 205, "speaker": "A", "start": 1965310, "end": 1972560, "text": "I'll tell. I'll tell you in what world? In the world where. I don't know. If you look, there's the survey data. I can, I can send this to you from.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 206, "speaker": "B", "start": 1973680, "end": 1976720, "text": "It's okay, let's do it. We'll do without sources. I'll take your word for it.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 207, "speaker": "A", "start": 1977440, "end": 2000090, "text": "Yeah. So it's just look at like, whether or not solving the Israeli Palestinian conflict is Even like, top 10 policy concerns for Israelis. It wasn't for the last, like, 20 years. It wasn't even like top 10. They're not interested in it. You know how it is. I don't know where you just moved to, but cost of living is exorbitant corruption. The judicial, not that bad.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 208, "speaker": "B", "start": 2000090, "end": 2001610, "text": "The corruption is really not that bad.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 209, "speaker": "A", "start": 2002810, "end": 2012730, "text": "Israelis are not concerned with the Israeli Palestinian conflict. That's not top of mind. That's not even the top of our discourse. You grew up in Israel in the 90s.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 210, "speaker": "B", "start": 2012970, "end": 2013370, "text": "No.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 211, "speaker": "A", "start": 2014250, "end": 2103640, "text": "Okay. We just called it the matzah. What do you think about the Matab? Everything was about the situation. Nobody's talking about this situation. Nobody's talking about the West Bank. These things are not top of mind. And that is a type of luxury that Israelis have built for themselves because of superior technology, because they care about defensiveness, because of a variety of different factors have put them in a very different situation. That's no longer the case after October 7th, when you run the numbers. Now Israelis are much more concerned about solving the Israeli Palestinian conflict. So by and large, over the last few decades, yes, Israelis have felt a relative safety. And so within that context, they want peace, as in a complete cessation of hostilities. Of course they would want peace in that context. But if the situations were reversed, if the roles were flipped, then Israelis would say, wait, wait, wait. Before peace, we need justice. We need a situation in which that peace can even be sustainable in the first place. And so the fact Palestinians are not prioritizing peace, but are prioritizing other things is not shocking to me. The fact Israelis are prioritizing peace is not sending the kind of message that I think you Hope it sends. I think the audience should understand that there's a little bit of a difference there. It's not just that they are peace loving and they love war. We love life. The infidels, you know, love life and we love death. I don't think, I don't think it's as simple as that. But I just want to go back to the question of if it's 10% versus 90% of a chance of them attacking. Oh, man, my girlfriend just came back. I'm going to have to wrap up soon.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 212, "speaker": "B", "start": 2103640, "end": 2111270, "text": "Same. I'm really tired too. It's almost 1am here. Yeah, let's do it, bro. Anytime. I'm more than, more than happy to.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 213, "speaker": "A", "start": 2111270, "end": 2150950, "text": "Maybe give me one minute or just a couple minutes. Yeah, I think the question that, that I'm asking is a slightly different one. So. And it depends on the lens that you use here. So I think that. Okay, if you think about it, I kind of think that. Okay, so I am not naive to think that Israel has enemies that try to destroy it. We have enemies that try to destroy us. There's no doubt about that. There's. Which I think is a lot to say from somebody who you think would be in my position. Right. Like I believe that they are trying to harm us.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 214, "speaker": "B", "start": 2150950, "end": 2159830, "text": "I can't even tell what your position is, to be completely honest. You kept me like, you kept me pretty. You kept me guessing this entire time. I don't know where the fuck you line up. I have no idea.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 215, "speaker": "A", "start": 2161000, "end": 2227020, "text": "Nice. I think I'm just. Well, I'll tell you, maybe this will help to distill it. I think that Israelis need to do two things. One is to remove and reduce the ability of our enemies to harm us. Right. And this you often do with an army and with a Shabak and a Mossad and all of that stuff, the security apparatus. And second is to reduce the motivation of our enemies to harm us. And that I think you often do with statecraft and with cultural whatever. I think we tended to be pretty good at the first thing. We've tended to be pretty good at reducing the actual capability of harming us. That's, I think, the case. I mean, if it's going to be changing. But if you look at like what happened, the way 48 started versus the way 48 ended and then it's Israel just become just the power asymmetry has been quite in our favor for the last few decades. I'm not sure that it will sustain in that way. But I think that's been the situation if you look at the motivation to harm us, on the other hand, I think that we've continually increased the. Our enemy's desire to harm us, and. Which is why I'm not necessarily holding the army accountable for all that stuff.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 216, "speaker": "B", "start": 2227020, "end": 2259910, "text": "But you're also totally. You're totally looking at this through a Palestinian lens instead of looking at it from the Arab lens, which is the way that they look at it. You're. You're explaining the power. You're explaining the power dynamics, explaining the power dynamics as Israel versus Palestine rather than the way that they represent it to the Arab world, which is Israel versus the Arabs. And we're not out of the woods yet like we are doing. We're making incredible strides at getting the enemy to stop attacking us. We actually have been doing a very good job at that. We're dissuading them from attacking us. Opposite to what you said. We. We aren't.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 217, "speaker": "A", "start": 2260150, "end": 2267310, "text": "No, I don't. I think that you've mostly just reduced their ability to hold. Harm us. I don't think you've discouraged them.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 218, "speaker": "B", "start": 2267310, "end": 2284230, "text": "Of course you've discouraged them. Where's the motive? Sorry? Where's the motivation for the average Syrian? They would never. They'll talk a lot, but they would never dare attack Israel. The average Syrian, the motivation they had in 67 and 48 is not there anymore.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 219, "speaker": "A", "start": 2285350, "end": 2285750, "text": "No, no.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 220, "speaker": "B", "start": 2285750, "end": 2291990, "text": "Okay, so they, they talk a lot. Algeria, Libya, Tunisia. They would never. Egypt would never. Jordan would never.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 221, "speaker": "A", "start": 2294090, "end": 2298890, "text": "Wait, now I'm confused about your position. Are you saying that we've pacified the Arab street?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 222, "speaker": "B", "start": 2299610, "end": 2313210, "text": "No, but we have. Not totally, but we've. We've slapped them into some. Some level of. What is it not subordinate or, or like the opposite of subordinate? I don't know. I can't figure out the word in English for some reason.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 223, "speaker": "A", "start": 2314090, "end": 2321940, "text": "Are you, Are you saying that it's. That they are. They are not more encouraged to harm us?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 224, "speaker": "B", "start": 2323300, "end": 2327300, "text": "In some ways they are, but they would never act upon it. It's all talk. They wouldn't actually do it.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 225, "speaker": "A", "start": 2327540, "end": 2369680, "text": "No, no, no, no, but I understand, but I'm trying to draw a distinction there. I think that military power can only go so far into pacifying people. You're absolutely right. That it can remove people's ability to harm us and perhaps put them. I mean, you seem to think that you understand Arabs and Palestinians. Like, at what point in history are you, like, maybe you're familiar with an example where they've just been so humiliated and so defeated violently that at some point they're like, all right, all right, fine. Fine, fine. Now I'm your friend now I like you now also. No, they just, they'll sit back and of course they'll continue to plot to destroy you. Obviously, that's what happens. Do you know a situation in history where that hasn't been the case?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 226, "speaker": "B", "start": 2369680, "end": 2377040, "text": "And I'm saying, Wait, I'm saying, are you thinking you can solve that by, you know, economic boom and they don't.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 227, "speaker": "A", "start": 2377280, "end": 2378080, "text": "How do I fix that?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 228, "speaker": "B", "start": 2378080, "end": 2382160, "text": "Like, like, do you think that you're gonna solve that with like health care and better TV and better education?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 229, "speaker": "A", "start": 2384000, "end": 2385240, "text": "Not necessarily. Not necessarily.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 230, "speaker": "B", "start": 2385240, "end": 2392800, "text": "But that's not going away. That's a. It's a core tenet of their society. Not just Palestinians, by the way. This is like a Levantine Arab problem.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 231, "speaker": "A", "start": 2394000, "end": 2395680, "text": "Which one? The destruction of Israel.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 232, "speaker": "B", "start": 2396000, "end": 2416100, "text": "Yeah. And kind of the destruction of themselves as well. Like the internal racism and hatred for one another. And a big. And a big part of that comes, by the way, a big. A huge part of that is due to Arab colonialism in the region. They are all sold this idea that they are something that they are not. They have. These people have the biggest fucking identity crisis. Okay, I'll give.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 233, "speaker": "A", "start": 2416180, "end": 2419700, "text": "I haven't, I'll give. You haven't watched your stuff enough to know. Can you say what you mean by that?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 234, "speaker": "B", "start": 2419700, "end": 2523900, "text": "I'll give you the biggest flushed out idea on this and then I really have to go to bed. I'm very tired. Yeah, okay. If this is food for thought for the end of the conversation, I think you'll really appreciate this talking point and you'll probably have a lot of good things to say about it. The average Egyptian kid grows up in Giza, right? Or the average Iraqi kid grows up in Baghdad. Their whole lives, they're sold the story that they are the descendants of Muhammad Alam from Mecca and Medina. They're always told that they are the Arabs, they are descendants of Ismail, they're Ben Israel, but in the same heartbeat, they're living around these massive pyramids, Ancient Egypt, ancient Babylon, ziggurats. And they're being told in the same exact heartbeat that they are also the people who constructed this. They're being told that their ancestors constructed this, but also that they are Arabs and that they have allegiance to some sort of Arab world, to this Ummah, to this Muslim society that cares for them and loves them. But when you go to the Khalij and you go to the Hijaz and you speak to them, and I have an incredible video coming out about this, by the way, that I've been working on for a Long time with a Saudi guy who admitted all of this to me on camera on, on a web, on a website like this, where when you speak to those Arabs in the hal in the Hijaz, they will tell you verbatim without skipping a beat, no, Egyptians are not Arabs. They're not even real Muslims. Neither are Lebanese or Syrian. Definitely not Palestinians. 100%, I'm Iraqin. Iraqis are monkeys. They have nothing to do with being Arab. And we are the real Arabs. We are the real Muslims. And so this whole Arab world, this whole d. Arabia, is living in such a identity crisis that they have no idea who they are. They don't understand their own culture, they don't understand their own languages. They don't understand what the. They're seeing, their history.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 235, "speaker": "A", "start": 2525340, "end": 2529340, "text": "No, but people can have intersecting identities. Like, that's not hard to understand.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 236, "speaker": "B", "start": 2529500, "end": 2568230, "text": "But it doesn't function, it doesn't function with them because they are bound to supremacy. They are told. They are told. They are told that because they are Arabs, because they are Muslims, they are better than everyone else in their land. And they, they practice that by the way they act. They enact on that with dimitude throughout society. We've seen this and they still do it today. The Jews that are gone are just, they were one part of it. But every single Christian group in the Middle east is suffering once again. Let me, let me finish this thought because again, they, they actually put that to action. They, they put their supremacy to action every single day today. So, okay, you can have intersecting identities, but with them it doesn't work. They're told that they have to.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 237, "speaker": "A", "start": 2568470, "end": 2570310, "text": "Okay, but that's a totally separate point.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 238, "speaker": "B", "start": 2570390, "end": 2575830, "text": "It's not a separate point because they are told. They are told they're supposed to have allegiance. They're told.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 239, "speaker": "A", "start": 2576070, "end": 2576830, "text": "Are you Mexican?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 240, "speaker": "B", "start": 2576830, "end": 2577910, "text": "No, but. No.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 241, "speaker": "A", "start": 2577990, "end": 2579670, "text": "Are you Hispanic? Are you Chicano?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 242, "speaker": "B", "start": 2579830, "end": 2606840, "text": "It's not like this is something in your blood. They are told that they are a part of something that the head of that group, the most successful part of the group, is telling them all the time and sending them signals that, no, you're definitely not, you're definitely not. I expect you to have allegiance to me, but also like you are not one of me. I would never accept you. I'm definitely never gonna help you out either, bro. It's, it's non functioning. It's like when you look at it, it's the biggest fucking scam we've ever been sold.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 243, "speaker": "A", "start": 2607560, "end": 2611800, "text": "Okay, so let's come back, let's come back to this. I'll just diagnose what I'm hearing.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 244, "speaker": "B", "start": 2611800, "end": 2612840, "text": "Okay, sure.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 245, "speaker": "A", "start": 2613080, "end": 2613800, "text": "There is the.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 246, "speaker": "B", "start": 2613880, "end": 2615560, "text": "I know it's a broad concept, but.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 247, "speaker": "A", "start": 2615960, "end": 2627720, "text": "Yeah, I mean, it's. There's the question about whether or not what you've described is an accurate analysis of the, the Arab brain.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 248, "speaker": "B", "start": 2627720, "end": 2630200, "text": "Would it be accurate if I had a Saudi guy saying it?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 249, "speaker": "A", "start": 2631160, "end": 2632160, "text": "No, not necessarily.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 250, "speaker": "B", "start": 2632160, "end": 2637320, "text": "Can I actually, can I actually show you the clip for a sec? Is that okay? It's. It's like a minute clip. Can I show it to you?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 251, "speaker": "A", "start": 2637320, "end": 2638920, "text": "But it doesn't really matter because.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 252, "speaker": "B", "start": 2638920, "end": 2641560, "text": "But can I anyways, I would just love to hear what you say about it.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 253, "speaker": "A", "start": 2641640, "end": 2655620, "text": "Okay, so I'll watch it, but just while I still have these other two thoughts. Okay. The first is whether or not even what you. Or what he describes as this identity crisis at all maps onto the Arab brain. That's the first question, Right?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 254, "speaker": "B", "start": 2655620, "end": 2657980, "text": "If it maps onto the Arab. Like if they perceive it.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 255, "speaker": "A", "start": 2659100, "end": 2698810, "text": "No, not necessarily perceive the analysis. Right. But if, if they are vitiated internally by this identity conflict. I'm skeptical that they are. I think they're actually, I think there is a conflict in them, but I don't think it's whether or not we're Arab or whether or not we're Egyptian. I don't think they see it this way, historically speaking. That's not what happened. I think the story itself is pretty easy to understand. How some Arabs came to control some parts of society and nevertheless it was stitched on top of, you know, existing identities and that's how Islam spread. Fine, that's. That's a totally coherent concept. And they, I think every person understands it. It's easy.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 256, "speaker": "B", "start": 2698810, "end": 2699610, "text": "You'd be surprised.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 257, "speaker": "A", "start": 2699610, "end": 2735160, "text": "But okay, maybe, maybe so. The. So that's. Yeah, the first question about whether or not that theory is even accurate, that this is the good description of what's happening in the brain. The second, the second one is if it is a good description, does it help to explain the. You called it, like the non functioning of it. That might help explain it. I'm skeptical about that too, but I think that would be a separate point. I might even agree with a second point. But I disagree with that first point. I don't. But okay, those are the two things to unpack. And then the third is whether or not any of that is relevant.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 258, "speaker": "B", "start": 2735320, "end": 2740520, "text": "Of course it's relevant. Are you kidding me? It's like super relevant as the Palestinian issue, by the way.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 259, "speaker": "A", "start": 2741000, "end": 2744240, "text": "It, it. I also suspect it's. It's totally irrelevant.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 260, "speaker": "B", "start": 2744240, "end": 2749640, "text": "It's. It's totally irrelevant. A lot of these people are Jews, man. A lot of these Palestinians are ancestrally Israelite.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 261, "speaker": "A", "start": 2749960, "end": 2752050, "text": "No, but that. That's fine. They get that.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 262, "speaker": "B", "start": 2754450, "end": 2761970, "text": "I think you. Again, I don't know if you've ever gotten. Have you gotten in depth with Palestinians about this specific topic?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 263, "speaker": "A", "start": 2762290, "end": 2763450, "text": "Yeah, plenty.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 264, "speaker": "B", "start": 2763450, "end": 2767970, "text": "And what is the resounding answer that you get? That they know that they're Jewish.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 265, "speaker": "A", "start": 2769490, "end": 2783230, "text": "So first, it depends, by and large. So I asked. Actually, I asked somebody that question about a month ago. How widespread is knowledge that many. Not all, I think is like a third of Palestinians that have, like, Jewish ancestry.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 266, "speaker": "B", "start": 2783230, "end": 2784550, "text": "Probably. Probably more than that.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 267, "speaker": "A", "start": 2784710, "end": 2802070, "text": "No, I think. I think we brought in a guy to the discord, and he does all of the genetic analysis, and I think it was something like that. It's how widespread. He said he doesn't know how. How widespread it. Like, the knowledge of it is because it's not even talked about.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 268, "speaker": "B", "start": 2802310, "end": 2802870, "text": "Correct.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 269, "speaker": "A", "start": 2803200, "end": 2825840, "text": "Yeah, so he doesn't know, but it's. It's certainly the. I mean, I'll tell you, I had an Arabic teacher who. She did like, a 23andMe, and it turns out that she had Jewish ancestry, and she went and wrote about this on Facebook, and she's from Gaza. And then her Gazan friend said, you know, this is. This is outrageous. Why would you say something like this? You should take it down. And so she kind of. What do you call it?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 270, "speaker": "B", "start": 2825840, "end": 2826080, "text": "She.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 271, "speaker": "A", "start": 2826080, "end": 2830320, "text": "She asked her friend to go and take the same test, and she took the test and found out that she's Jewish.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 272, "speaker": "B", "start": 2831580, "end": 2831860, "text": "All right.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 273, "speaker": "A", "start": 2831860, "end": 2832260, "text": "Okay.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 274, "speaker": "B", "start": 2832260, "end": 2849180, "text": "I gotta go to sleep. I'm super tired, man. Adam, Adam, Adam. But you're gonna be around, like, do you come to Israel frequently?", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 275, "speaker": "A", "start": 2849660, "end": 2850380, "text": "Yeah, frequently.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 276, "speaker": "B", "start": 2850380, "end": 2850820, "text": "Okay.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 277, "speaker": "A", "start": 2850820, "end": 2852300, "text": "Do something in person. Or we could do something.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 278, "speaker": "B", "start": 2852300, "end": 2941870, "text": "I would love to. I would love to schedule something with Adele soon as well. We could do something together. Okay. Very nice to meet you, bro. See you, brother. Bye bye. Bye bye. That was a very, very fascinating conversation, ladies and gentlemen. We. I felt like I really held up my. My ground on that one. Adar, by the way, if you guys don't know who Adar Weinreb is, he's. He's a very, very fascinating individual as well, I would say. I don't want to classify him as a lefty, but he kind of is a lefty Israeli American. We will have a debate one day on the channel soon, and it will be very interesting. And. And that's all I have to say about that. I'm gonna go to sleep. Goodbye, guys. Love you, man. These comment sections are insane. What do you mean? Literally every comment is just like, Making fun of Jewish people, saying some stupid shit like it was promised to them 3,000 years ago. Kicked out of 109 countries, white colonizers. Then a bunch of Jews in the comment section getting triggered and calling it anti Semitism. It's honestly, it's bringing me down. Okay, well, here, take this. What's this? It's a white colonizer shirt from the travelingclat.com and here, take a matching hat. Why do you want me to wear this? Because when we laugh in their faces, it triggers them more. Like, for example, my grandparents were kicked out of Baghdad, Iraq, Right? So guess what? I'm your bag daddy. Get it. And boom, here's a hat with a kube on it. So you're saying when they make fun of us, just wear it. Precisely. What will trigger the stupid pro pals more than you proudly joining the 109 Club for being kicked out of 109 countries. Or are you openly embracing being a white colonizer or even just acknowledging that everything was promised to you 3000 years ago? Don't run from it.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 279, "speaker": "A", "start": 2942430, "end": 2943790, "text": "Embrace it. Bet.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
{"turn_id": 280, "speaker": "B", "start": 2943950, "end": 2963630, "text": "TheTravelingClat.com Embrace the meme. Embrace the Jew hatred and laugh in their face. TheTravelingClat.com if you don't want to buy any merchandise, the best way to support me is by donating on buy me a coffee, my PayPal, or becoming a member on my Patreon. Your support is very much needed and very much appreciated. Thank you.", "source": "88013c2f-49aa-422c-ba96-b9fe95633bba"}
